In [1]:
import pandas as pd

In [2]:
df_movies = pd.read_csv('IMDb movies.csv', low_memory=False)
df_ratings = pd.read_csv('IMDb ratings.csv')

In [3]:
# select columns
df_movies = df_movies[['imdb_title_id', 'title', 'year',
                       'genre', 'country']]

df_ratings = df_ratings[['imdb_title_id', 'total_votes', 'mean_vote']]

# merge()

In [4]:
df1 = pd.DataFrame({'id' : ['A', 'B', 'C', 'D'],
              'age' : [30,23,25,22]})
df2 = pd.DataFrame({'id' : ['C', 'D', 'E', 'F'],
                    'job' : ['Doctor', 'Statistician', 'Accountant', 'Developer']})

In [5]:
df1

  id  age
0  A   30
1  B   23
2  C   25
3  D   22

In [6]:
df2

  id           job
0  C        Doctor
1  D  Statistician
2  E    Accountant
3  F     Developer

## Inner join

In [7]:
df_inner_join = df1.merge(df2, on='id', how='inner')

In [8]:
# shape
df1.shape, df2.shape, df_inner_join.shape

((4, 2), (4, 2), (2, 3))

### Exercise

In [9]:
# merge df_movies and df_ratings (inner join)
df_movies.merge(df_ratings, on='imdb_title_id')
# pd.merge(df_movies, df_ratings, on='imdb_title_id')

,imdb_title_id,title,year,genre,country,total_votes,mean_vote
0,tt0000009,Miss Jerry,1894,Romance,USA,154,5.9
1,tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia,589,6.3
2,tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark",188,6.0
3,tt0002101,Cleopatra,1912,"Drama, History",USA,446,5.3
4,tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy,2237,6.9
...,...,...,...,...,...,...,...
85850,tt9908390,Le lion,2020,Comedy,"France, Belgium",398,5.5
85851,tt9911196,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands,724,7.9
85852,tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India,265,7.8
85853,tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey,194,9.4
85854,tt9914942,La vida sense la Sara Amat,2019,Drama,Spain,102,6.8

## Outer join (Full join)

In [10]:
df1.merge(df2, on='id', how='outer')

  id   age           job
0  A  30.0           NaN
1  B  23.0           NaN
2  C  25.0        Doctor
3  D  22.0  Statistician
4  E   NaN    Accountant
5  F   NaN     Developer

In [11]:
# shape
df1.shape, df2.shape, pd.merge(df1, df2, on='id', how='outer').shape

((4, 2), (4, 2), (6, 3))

### Exercise

In [12]:
# merge df_movies and df_ratings (outer join)
df_movies.merge(df_ratings, on='imdb_title_id', how='outer')

,imdb_title_id,title,year,genre,country,total_votes,mean_vote
0,tt0000009,Miss Jerry,1894,Romance,USA,154,5.9
1,tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia,589,6.3
2,tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark",188,6.0
3,tt0002101,Cleopatra,1912,"Drama, History",USA,446,5.3
4,tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy,2237,6.9
...,...,...,...,...,...,...,...
85850,tt9908390,Le lion,2020,Comedy,"France, Belgium",398,5.5
85851,tt9911196,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands,724,7.9
85852,tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India,265,7.8
85853,tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey,194,9.4
85854,tt9914942,La vida sense la Sara Amat,2019,Drama,Spain,102,6.8

## Exclusive Outer join (Exclusive Full join)

In [13]:
df1.merge(df2, on='id', how='outer')

  id   age           job
0  A  30.0           NaN
1  B  23.0           NaN
2  C  25.0        Doctor
3  D  22.0  Statistician
4  E   NaN    Accountant
5  F   NaN     Developer

In [14]:
# indicator=True
df1.merge(df2, on='id', how='outer', indicator=True)

  id   age           job      _merge
0  A  30.0           NaN   left_only
1  B  23.0           NaN   left_only
2  C  25.0        Doctor        both
3  D  22.0  Statistician        both
4  E   NaN    Accountant  right_only
5  F   NaN     Developer  right_only

In [15]:
# query
df1.merge(df2, on='id', how='outer', indicator=True).query("_merge=='left_only' or _merge=='right_only'")

  id   age         job      _merge
0  A  30.0         NaN   left_only
1  B  23.0         NaN   left_only
4  E   NaN  Accountant  right_only
5  F   NaN   Developer  right_only

In [16]:
# shape
df1.merge(df2, on='id', how='outer', indicator=True).query("_merge=='left_only' or _merge=='right_only'").shape, df1.shape, df2.shape

((4, 4), (4, 2), (4, 2))

### Exercise

In [17]:
# merge df_movies and df_ratings
df_movies.merge(df_ratings, on='imdb_title_id', how='outer', 
                indicator=True).query("_merge != 'both'")

Empty DataFrame
Columns: [imdb_title_id, title, year, genre, country, total_votes, mean_vote, _merge]
Index: []

##  Left join

In [18]:
df1.merge(df2, on='id', how='left')

  id  age           job
0  A   30           NaN
1  B   23           NaN
2  C   25        Doctor
3  D   22  Statistician

### Exercise

In [19]:
# extract a 50% sample of the df_movies dataframe
df_movies_sample = df_movies.sample(frac=0.5)

In [20]:
# merge df_movies_sample and df_ratings (left join)
df_movies_sample.merge(df_ratings, on='imdb_title_id', how='left')

,imdb_title_id,title,year,genre,country,total_votes,mean_vote
0,tt0244567,Jhoothi,1985,Comedy,India,123,6.8
1,tt0109900,Giorgino,1994,"Adventure, Drama, Horror",France,885,7.8
2,tt2585798,Global Player - Wo wir sind isch vorne,2013,"Comedy, Drama",Germany,207,6.9
3,tt0276276,Lawless Heart,2001,"Comedy, Drama, Romance","UK, France",1309,7.0
4,tt5701082,Supreme,2016,"Action, Comedy",India,488,6.4
...,...,...,...,...,...,...,...
42923,tt0036175,Mr. Muggs Steps Out,1943,Comedy,USA,281,8.4
42924,tt9636256,Sindhubaadh,2019,"Action, Thriller",India,320,5.8
42925,tt0852713,La coniglietta di casa,2008,"Comedy, Romance",USA,78215,5.8
42926,tt5668822,Wildwitch - Il mondo selvatico,2018,"Family, Fantasy","Denmark, Norway, Hungary, Czech Republic",387,5.1
42927,tt0130971,Quand je serai parti... vous vivrez encore,1999,"Action, Drama, History",Canada,106,6.4

In [21]:
# shape
df_movies_sample.shape, df_ratings.shape, df_movies_sample.merge(df_ratings, on='imdb_title_id', how='left').shape

((42928, 5), (85855, 3), (42928, 7))

## Exclusive Left join

In [22]:
# indicator=True
df1.merge(df2, on='id', how='outer', indicator=True)

  id   age           job      _merge
0  A  30.0           NaN   left_only
1  B  23.0           NaN   left_only
2  C  25.0        Doctor        both
3  D  22.0  Statistician        both
4  E   NaN    Accountant  right_only
5  F   NaN     Developer  right_only

In [23]:
# query
df1.merge(df2, on='id', how='outer', indicator=True).query("_merge == 'left_only'")

  id   age  job     _merge
0  A  30.0  NaN  left_only
1  B  23.0  NaN  left_only

In [24]:
# left join
pd.merge(df_movies, df_ratings.sample(frac=0.5), on='imdb_title_id', 
         how='outer', indicator=True).query("_merge == 'left_only'")

,imdb_title_id,title,year,genre,country,total_votes,mean_vote,_merge
0,tt0000009,Miss Jerry,1894,Romance,USA,NaN,NaN,left_only
2,tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark",NaN,NaN,left_only
5,tt0002199,"From the Manger to the Cross; or, Jesus of Naz...",1912,"Biography, Drama",USA,NaN,NaN,left_only
6,tt0002423,Madame DuBarry,1919,"Biography, Drama, Romance",Germany,NaN,NaN,left_only
8,tt0002452,Independenta Romaniei,1912,"History, War",Romania,NaN,NaN,left_only
...,...,...,...,...,...,...,...,...
85847,tt9905412,Ottam,2019,Drama,India,NaN,NaN,left_only
85848,tt9905462,Pengalila,2019,Drama,India,NaN,NaN,left_only
85849,tt9906644,Manoharam,2019,"Comedy, Drama",India,NaN,NaN,left_only
85850,tt9908390,Le lion,2020,Comedy,"France, Belgium",NaN,NaN,left_only
85854,tt9914942,La vida sense la Sara Amat,2019,Drama,Spain,NaN,NaN,left_only

### Exercise

In [25]:
# make a copy of the df_movies dataframe
df_movies_copy = df_movies.copy()

In [26]:
# set the first 1000 values of 'imdb_title_id' column as 'tt1234567890'
df_movies_copy.iloc[:1000, df_movies_copy.columns.get_loc('imdb_title_id')] = 'tt1234567890'
# df_movies_copy.columns.get_loc('imdb_title_id') : returns the location of the column

In [27]:
# merge df_movies_2 and df_ratings (exclusive left join)
df_exclusive_left = df_movies_copy.merge(df_ratings, on='imdb_title_id', how='outer',
                     indicator=True).query("_merge == 'left_only'")

In [28]:
# shape
df_movies_copy.shape, df_ratings.shape, df_exclusive_left.shape

((85855, 5), (85855, 3), (1000, 8))

## Right join

In [29]:
df1.merge(df2, on='id', how='right')

  id   age           job
0  C  25.0        Doctor
1  D  22.0  Statistician
2  E   NaN    Accountant
3  F   NaN     Developer

### Exercise

In [30]:
# extract a 30% sample of the df_ratings dataframe
df_ratings_sample = df_ratings.sample(frac=0.3)

In [31]:
# merge df_movies and df_ratings_sample (right join)
df_right = df_movies.merge(df_ratings_sample, on='imdb_title_id', how='right')

In [32]:
# shape
print(df_movies.shape)
print(df_ratings_sample.shape)
print(df_right.shape)

(85855, 5)
(25756, 3)
(25756, 7)

## Exclusive Right join

In [33]:
# indicator=True
df1.merge(df2, on='id', how='outer',
          indicator = True)

  id   age           job      _merge
0  A  30.0           NaN   left_only
1  B  23.0           NaN   left_only
2  C  25.0        Doctor        both
3  D  22.0  Statistician        both
4  E   NaN    Accountant  right_only
5  F   NaN     Developer  right_only

In [34]:
# query
df1.merge(df2, on='id', how='outer',
          indicator = True).query("_merge=='right_only'")

  id  age         job      _merge
4  E  NaN  Accountant  right_only
5  F  NaN   Developer  right_only

### Exercise

In [35]:
# make a copy of the df_ratings dataframe
df_ratings_2 = df_ratings.copy()

In [36]:
# set the first 1000 values of 'imdb_title_id' column as 'tt1234567890'
df_ratings_2.iloc[:1000, 0] = 'tt1234567890'
# you can use .loc[:999, 'imdb_title_id'] = '' : 999 is thier because it is inclusive, in iloc the 1000 is exclusive
# [:1000, 0] : ":1000" refers to start to 1000 rows and 
#               "0" refers to the column location of imdb_title_id or you can use "df_ratings_2.columns.get_loc('imdb_title_id')" to get the location

In [37]:
# merge df_movies and df_ratings_2 (exclusive right join)
df_exclusive_right = df_movies.merge(df_ratings_2, on='imdb_title_id', how='outer',
                indicator=True).query("_merge == 'right_only'")
df_exclusive_right

,imdb_title_id,title,year,genre,country,total_votes,mean_vote,_merge
55817,tt1234567890,NaN,NaN,NaN,NaN,154.0,5.9,right_only
55818,tt1234567890,NaN,NaN,NaN,NaN,589.0,6.3,right_only
55819,tt1234567890,NaN,NaN,NaN,NaN,188.0,6.0,right_only
55820,tt1234567890,NaN,NaN,NaN,NaN,446.0,5.3,right_only
55821,tt1234567890,NaN,NaN,NaN,NaN,2237.0,6.9,right_only
...,...,...,...,...,...,...,...,...
56812,tt1234567890,NaN,NaN,NaN,NaN,128.0,5.8,right_only
56813,tt1234567890,NaN,NaN,NaN,NaN,160.0,6.6,right_only
56814,tt1234567890,NaN,NaN,NaN,NaN,106.0,7.2,right_only
56815,tt1234567890,NaN,NaN,NaN,NaN,172.0,6.2,right_only
56816,tt1234567890,NaN,NaN,NaN,NaN,103.0,7.0,right_only

In [38]:
# shape
df_movies.shape, df_ratings_2.shape, df_exclusive_right.shape

((85855, 5), (85855, 3), (1000, 8))